; domain
(define (domain joint_car-assistance1_domain)
(:requirements :typing :action-costs)

(:types
    place car - object
)

(:constants
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (adj-walk ?s1 - place ?s2 -  place)
    (adj-car ?s1 - place ?s2 -  place)
    (at-supporter ?s -  place)
    (at-car ?car - car ?s -  place)
    (supporter-inside ?car -  car)
    (free ?car -  car)
    (at-prime ?s -  place)
    (prime-inside ?car -  car)
)

(:functions
    (total-cost) - number
)

(:action sup_walk-supporter
    :parameters (?from - place ?to - place)
    :precondition (and
        (supporter_turn)
        (adj-walk ?from ?to)
        (at-supporter ?from)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-supporter ?to)
        (not (at-supporter ?from))
        (increase (total-cost) 1.0)
    )
)

(:action sup_get-into-car-supporter
    :parameters (?position - place ?car - car)
    :precondition (and
        (supporter_turn)
        (at-supporter ?position)
        (at-car ?car ?position)
        (free ?car)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (supporter-inside ?car)
        (not (at-supporter ?position))
        (not (free ?car))
        (increase (total-cost) 1.0)
    )
)

(:action sup_get-out-car-supporter
    :parameters (?position - place ?car - car)
    :precondition (and
        (supporter_turn)
        (supporter-inside ?car)
        (at-car ?car ?position)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-supporter ?position)
        (free ?car)
        (not (supporter-inside ?car))
        (increase (total-cost) 1.0)
    )
)

(:action sup_drive-supporter
    :parameters (?from - place ?to - place ?car - car)
    :precondition (and
        (supporter_turn)
        (adj-car ?from ?to)
        (at-car ?car ?from)
        (supporter-inside ?car)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-car ?car ?to)
        (not (at-car ?car ?from))
        (increase (total-cost) 1.0)
    )
)

(:action pri_walk-prime
    :parameters (?from - place ?to - place)
    :precondition (and
        (prime_turn)
        (adj-walk ?from ?to)
        (at-prime ?from)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?to)
        (not (at-prime ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_get-into-car-prime
    :parameters (?position - place ?car - car)
    :precondition (and
        (prime_turn)
        (at-prime ?position)
        (at-car ?car ?position)
        (free ?car)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (prime-inside ?car)
        (not (at-prime ?position))
        (not (free ?car))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_get-out-car-prime
    :parameters (?position - place ?car - car)
    :precondition (and
        (prime_turn)
        (prime-inside ?car)
        (at-car ?car ?position)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?position)
        (free ?car)
        (not (prime-inside ?car))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_drive-prime
    :parameters (?from - place ?to - place ?car - car)
    :precondition (and
        (prime_turn)
        (adj-car ?from ?to)
        (at-car ?car ?from)
        (prime-inside ?car)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-car ?car ?to)
        (not (at-car ?car ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_car-assistance1_problem_10)
(:domain joint_car-assistance1_domain)
(:objects
    pos0-2 pos0-3 pos0-4 pos0-5 pos0-6 pos0-7 pos0-8 pos0-9 pos0-10 pos0-11 pos0-13 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos1-5 pos1-6 pos1-7 pos1-8 pos1-10 pos1-11 pos1-13 pos2-0 pos2-2 pos2-3 pos2-4 pos2-5 pos2-7 pos2-8 pos2-9 pos2-11 pos2-12 pos2-13 pos2-14 pos3-0 pos3-2 pos3-4 pos3-5 pos3-6 pos3-7 pos3-8 pos3-10 pos3-12 - place
    car0 - car
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (adj-walk pos0-2 pos0-3)
    (adj-walk pos0-3 pos0-2)
    (adj-walk pos0-2 pos1-2)
    (adj-walk pos1-2 pos0-2)
    (adj-car pos0-2 pos0-3)
    (adj-car pos0-3 pos0-2)
    (adj-car pos0-2 pos0-4)
    (adj-car pos0-4 pos0-2)
    (adj-car pos0-2 pos0-5)
    (adj-car pos0-5 pos0-2)
    (adj-car pos0-2 pos1-2)
    (adj-car pos1-2 pos0-2)
    (adj-car pos0-2 pos2-2)
    (adj-car pos2-2 pos0-2)
    (adj-car pos0-2 pos3-2)
    (adj-car pos3-2 pos0-2)
    (adj-walk pos0-3 pos0-4)
    (adj-walk pos0-4 pos0-3)
    (adj-walk pos0-3 pos1-3)
    (adj-walk pos1-3 pos0-3)
    (adj-car pos0-3 pos0-4)
    (adj-car pos0-4 pos0-3)
    (adj-car pos0-3 pos0-5)
    (adj-car pos0-5 pos0-3)
    (adj-car pos0-3 pos0-6)
    (adj-car pos0-6 pos0-3)
    (adj-car pos0-3 pos1-3)
    (adj-car pos1-3 pos0-3)
    (adj-car pos0-3 pos2-3)
    (adj-car pos2-3 pos0-3)
    (adj-walk pos0-4 pos0-5)
    (adj-walk pos0-5 pos0-4)
    (adj-walk pos0-4 pos1-4)
    (adj-walk pos1-4 pos0-4)
    (adj-car pos0-4 pos0-5)
    (adj-car pos0-5 pos0-4)
    (adj-car pos0-4 pos0-6)
    (adj-car pos0-6 pos0-4)
    (adj-car pos0-4 pos0-7)
    (adj-car pos0-7 pos0-4)
    (adj-car pos0-4 pos1-4)
    (adj-car pos1-4 pos0-4)
    (adj-car pos0-4 pos2-4)
    (adj-car pos2-4 pos0-4)
    (adj-car pos0-4 pos3-4)
    (adj-car pos3-4 pos0-4)
    (adj-walk pos0-5 pos0-6)
    (adj-walk pos0-6 pos0-5)
    (adj-walk pos0-5 pos1-5)
    (adj-walk pos1-5 pos0-5)
    (adj-car pos0-5 pos0-6)
    (adj-car pos0-6 pos0-5)
    (adj-car pos0-5 pos0-7)
    (adj-car pos0-7 pos0-5)
    (adj-car pos0-5 pos0-8)
    (adj-car pos0-8 pos0-5)
    (adj-car pos0-5 pos1-5)
    (adj-car pos1-5 pos0-5)
    (adj-car pos0-5 pos2-5)
    (adj-car pos2-5 pos0-5)
    (adj-car pos0-5 pos3-5)
    (adj-car pos3-5 pos0-5)
    (adj-walk pos0-6 pos0-7)
    (adj-walk pos0-7 pos0-6)
    (adj-walk pos0-6 pos1-6)
    (adj-walk pos1-6 pos0-6)
    (adj-car pos0-6 pos0-7)
    (adj-car pos0-7 pos0-6)
    (adj-car pos0-6 pos0-8)
    (adj-car pos0-8 pos0-6)
    (adj-car pos0-6 pos0-9)
    (adj-car pos0-9 pos0-6)
    (adj-car pos0-6 pos1-6)
    (adj-car pos1-6 pos0-6)
    (adj-walk pos0-7 pos0-8)
    (adj-walk pos0-8 pos0-7)
    (adj-walk pos0-7 pos1-7)
    (adj-walk pos1-7 pos0-7)
    (adj-car pos0-7 pos0-8)
    (adj-car pos0-8 pos0-7)
    (adj-car pos0-7 pos0-9)
    (adj-car pos0-9 pos0-7)
    (adj-car pos0-7 pos0-10)
    (adj-car pos0-10 pos0-7)
    (adj-car pos0-7 pos1-7)
    (adj-car pos1-7 pos0-7)
    (adj-car pos0-7 pos2-7)
    (adj-car pos2-7 pos0-7)
    (adj-car pos0-7 pos3-7)
    (adj-car pos3-7 pos0-7)
    (adj-walk pos0-8 pos0-9)
    (adj-walk pos0-9 pos0-8)
    (adj-walk pos0-8 pos1-8)
    (adj-walk pos1-8 pos0-8)
    (adj-car pos0-8 pos0-9)
    (adj-car pos0-9 pos0-8)
    (adj-car pos0-8 pos0-10)
    (adj-car pos0-10 pos0-8)
    (adj-car pos0-8 pos0-11)
    (adj-car pos0-11 pos0-8)
    (adj-car pos0-8 pos1-8)
    (adj-car pos1-8 pos0-8)
    (adj-car pos0-8 pos2-8)
    (adj-car pos2-8 pos0-8)
    (adj-car pos0-8 pos3-8)
    (adj-car pos3-8 pos0-8)
    (adj-walk pos0-9 pos0-10)
    (adj-walk pos0-10 pos0-9)
    (adj-car pos0-9 pos0-10)
    (adj-car pos0-10 pos0-9)
    (adj-car pos0-9 pos0-11)
    (adj-car pos0-11 pos0-9)
    (adj-walk pos0-10 pos0-11)
    (adj-walk pos0-11 pos0-10)
    (adj-walk pos0-10 pos1-10)
    (adj-walk pos1-10 pos0-10)
    (adj-car pos0-10 pos0-11)
    (adj-car pos0-11 pos0-10)
    (adj-car pos0-10 pos1-10)
    (adj-car pos1-10 pos0-10)
    (adj-walk pos0-11 pos1-11)
    (adj-walk pos1-11 pos0-11)
    (adj-car pos0-11 pos1-11)
    (adj-car pos1-11 pos0-11)
    (adj-car pos0-11 pos2-11)
    (adj-car pos2-11 pos0-11)
    (adj-walk pos0-13 pos1-13)
    (adj-walk pos1-13 pos0-13)
    (adj-car pos0-13 pos1-13)
    (adj-car pos1-13 pos0-13)
    (adj-car pos0-13 pos2-13)
    (adj-car pos2-13 pos0-13)
    (adj-walk pos1-0 pos1-1)
    (adj-walk pos1-1 pos1-0)
    (adj-walk pos1-0 pos2-0)
    (adj-walk pos2-0 pos1-0)
    (adj-car pos1-0 pos1-1)
    (adj-car pos1-1 pos1-0)
    (adj-car pos1-0 pos1-2)
    (adj-car pos1-2 pos1-0)
    (adj-car pos1-0 pos1-3)
    (adj-car pos1-3 pos1-0)
    (adj-car pos1-0 pos2-0)
    (adj-car pos2-0 pos1-0)
    (adj-car pos1-0 pos3-0)
    (adj-car pos3-0 pos1-0)
    (adj-walk pos1-1 pos1-2)
    (adj-walk pos1-2 pos1-1)
    (adj-car pos1-1 pos1-2)
    (adj-car pos1-2 pos1-1)
    (adj-car pos1-1 pos1-3)
    (adj-car pos1-3 pos1-1)
    (adj-car pos1-1 pos1-4)
    (adj-car pos1-4 pos1-1)
    (adj-walk pos1-2 pos1-3)
    (adj-walk pos1-3 pos1-2)
    (adj-walk pos1-2 pos2-2)
    (adj-walk pos2-2 pos1-2)
    (adj-car pos1-2 pos1-3)
    (adj-car pos1-3 pos1-2)
    (adj-car pos1-2 pos1-4)
    (adj-car pos1-4 pos1-2)
    (adj-car pos1-2 pos1-5)
    (adj-car pos1-5 pos1-2)
    (adj-car pos1-2 pos2-2)
    (adj-car pos2-2 pos1-2)
    (adj-car pos1-2 pos3-2)
    (adj-car pos3-2 pos1-2)
    (adj-walk pos1-3 pos1-4)
    (adj-walk pos1-4 pos1-3)
    (adj-walk pos1-3 pos2-3)
    (adj-walk pos2-3 pos1-3)
    (adj-car pos1-3 pos1-4)
    (adj-car pos1-4 pos1-3)
    (adj-car pos1-3 pos1-5)
    (adj-car pos1-5 pos1-3)
    (adj-car pos1-3 pos1-6)
    (adj-car pos1-6 pos1-3)
    (adj-car pos1-3 pos2-3)
    (adj-car pos2-3 pos1-3)
    (adj-walk pos1-4 pos1-5)
    (adj-walk pos1-5 pos1-4)
    (adj-walk pos1-4 pos2-4)
    (adj-walk pos2-4 pos1-4)
    (adj-car pos1-4 pos1-5)
    (adj-car pos1-5 pos1-4)
    (adj-car pos1-4 pos1-6)
    (adj-car pos1-6 pos1-4)
    (adj-car pos1-4 pos1-7)
    (adj-car pos1-7 pos1-4)
    (adj-car pos1-4 pos2-4)
    (adj-car pos2-4 pos1-4)
    (adj-car pos1-4 pos3-4)
    (adj-car pos3-4 pos1-4)
    (adj-walk pos1-5 pos1-6)
    (adj-walk pos1-6 pos1-5)
    (adj-walk pos1-5 pos2-5)
    (adj-walk pos2-5 pos1-5)
    (adj-car pos1-5 pos1-6)
    (adj-car pos1-6 pos1-5)
    (adj-car pos1-5 pos1-7)
    (adj-car pos1-7 pos1-5)
    (adj-car pos1-5 pos1-8)
    (adj-car pos1-8 pos1-5)
    (adj-car pos1-5 pos2-5)
    (adj-car pos2-5 pos1-5)
    (adj-car pos1-5 pos3-5)
    (adj-car pos3-5 pos1-5)
    (adj-walk pos1-6 pos1-7)
    (adj-walk pos1-7 pos1-6)
    (adj-car pos1-6 pos1-7)
    (adj-car pos1-7 pos1-6)
    (adj-car pos1-6 pos1-8)
    (adj-car pos1-8 pos1-6)
    (adj-walk pos1-7 pos1-8)
    (adj-walk pos1-8 pos1-7)
    (adj-walk pos1-7 pos2-7)
    (adj-walk pos2-7 pos1-7)
    (adj-car pos1-7 pos1-8)
    (adj-car pos1-8 pos1-7)
    (adj-car pos1-7 pos2-7)
    (adj-car pos2-7 pos1-7)
    (adj-car pos1-7 pos3-7)
    (adj-car pos3-7 pos1-7)
    (adj-walk pos1-8 pos2-8)
    (adj-walk pos2-8 pos1-8)
    (adj-car pos1-8 pos2-8)
    (adj-car pos2-8 pos1-8)
    (adj-car pos1-8 pos3-8)
    (adj-car pos3-8 pos1-8)
    (adj-walk pos1-10 pos1-11)
    (adj-walk pos1-11 pos1-10)
    (adj-car pos1-10 pos1-11)
    (adj-car pos1-11 pos1-10)
    (adj-walk pos1-11 pos2-11)
    (adj-walk pos2-11 pos1-11)
    (adj-car pos1-11 pos2-11)
    (adj-car pos2-11 pos1-11)
    (adj-walk pos1-13 pos2-13)
    (adj-walk pos2-13 pos1-13)
    (adj-car pos1-13 pos2-13)
    (adj-car pos2-13 pos1-13)
    (adj-walk pos2-0 pos3-0)
    (adj-walk pos3-0 pos2-0)
    (adj-car pos2-0 pos3-0)
    (adj-car pos3-0 pos2-0)
    (adj-walk pos2-2 pos2-3)
    (adj-walk pos2-3 pos2-2)
    (adj-walk pos2-2 pos3-2)
    (adj-walk pos3-2 pos2-2)
    (adj-car pos2-2 pos2-3)
    (adj-car pos2-3 pos2-2)
    (adj-car pos2-2 pos2-4)
    (adj-car pos2-4 pos2-2)
    (adj-car pos2-2 pos2-5)
    (adj-car pos2-5 pos2-2)
    (adj-car pos2-2 pos3-2)
    (adj-car pos3-2 pos2-2)
    (adj-walk pos2-3 pos2-4)
    (adj-walk pos2-4 pos2-3)
    (adj-car pos2-3 pos2-4)
    (adj-car pos2-4 pos2-3)
    (adj-car pos2-3 pos2-5)
    (adj-car pos2-5 pos2-3)
    (adj-walk pos2-4 pos2-5)
    (adj-walk pos2-5 pos2-4)
    (adj-walk pos2-4 pos3-4)
    (adj-walk pos3-4 pos2-4)
    (adj-car pos2-4 pos2-5)
    (adj-car pos2-5 pos2-4)
    (adj-car pos2-4 pos3-4)
    (adj-car pos3-4 pos2-4)
    (adj-walk pos2-5 pos3-5)
    (adj-walk pos3-5 pos2-5)
    (adj-car pos2-5 pos3-5)
    (adj-car pos3-5 pos2-5)
    (adj-walk pos2-7 pos2-8)
    (adj-walk pos2-8 pos2-7)
    (adj-walk pos2-7 pos3-7)
    (adj-walk pos3-7 pos2-7)
    (adj-car pos2-7 pos2-8)
    (adj-car pos2-8 pos2-7)
    (adj-car pos2-7 pos2-9)
    (adj-car pos2-9 pos2-7)
    (adj-car pos2-7 pos3-7)
    (adj-car pos3-7 pos2-7)
    (adj-walk pos2-8 pos2-9)
    (adj-walk pos2-9 pos2-8)
    (adj-walk pos2-8 pos3-8)
    (adj-walk pos3-8 pos2-8)
    (adj-car pos2-8 pos2-9)
    (adj-car pos2-9 pos2-8)
    (adj-car pos2-8 pos3-8)
    (adj-car pos3-8 pos2-8)
    (adj-walk pos2-11 pos2-12)
    (adj-walk pos2-12 pos2-11)
    (adj-car pos2-11 pos2-12)
    (adj-car pos2-12 pos2-11)
    (adj-car pos2-11 pos2-13)
    (adj-car pos2-13 pos2-11)
    (adj-car pos2-11 pos2-14)
    (adj-car pos2-14 pos2-11)
    (adj-walk pos2-12 pos2-13)
    (adj-walk pos2-13 pos2-12)
    (adj-walk pos2-12 pos3-12)
    (adj-walk pos3-12 pos2-12)
    (adj-car pos2-12 pos2-13)
    (adj-car pos2-13 pos2-12)
    (adj-car pos2-12 pos2-14)
    (adj-car pos2-14 pos2-12)
    (adj-car pos2-12 pos3-12)
    (adj-car pos3-12 pos2-12)
    (adj-walk pos2-13 pos2-14)
    (adj-walk pos2-14 pos2-13)
    (adj-car pos2-13 pos2-14)
    (adj-car pos2-14 pos2-13)
    (adj-walk pos3-4 pos3-5)
    (adj-walk pos3-5 pos3-4)
    (adj-car pos3-4 pos3-5)
    (adj-car pos3-5 pos3-4)
    (adj-car pos3-4 pos3-6)
    (adj-car pos3-6 pos3-4)
    (adj-car pos3-4 pos3-7)
    (adj-car pos3-7 pos3-4)
    (adj-walk pos3-5 pos3-6)
    (adj-walk pos3-6 pos3-5)
    (adj-car pos3-5 pos3-6)
    (adj-car pos3-6 pos3-5)
    (adj-car pos3-5 pos3-7)
    (adj-car pos3-7 pos3-5)
    (adj-car pos3-5 pos3-8)
    (adj-car pos3-8 pos3-5)
    (adj-walk pos3-6 pos3-7)
    (adj-walk pos3-7 pos3-6)
    (adj-car pos3-6 pos3-7)
    (adj-car pos3-7 pos3-6)
    (adj-car pos3-6 pos3-8)
    (adj-car pos3-8 pos3-6)
    (adj-walk pos3-7 pos3-8)
    (adj-walk pos3-8 pos3-7)
    (adj-car pos3-7 pos3-8)
    (adj-car pos3-8 pos3-7)
    (at-car car0 pos1-4)
    (free car0)
    (at-supporter pos3-4)
    (at-prime pos3-12)
)

(:goal
  (and
    (at-prime pos1-3)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_walk-supporter pos3-4 pos2-4)
   deleted: (supporter_turn) (at-supporter pos3-4)
   added: (prime_turn) (at-supporter pos2-4)
   goals met: 0 of 1
2. (pri_walk-prime pos3-12 pos2-12)
   deleted: (prime_turn) (at-prime pos3-12)
   added: (supporter_turn) (at-prime pos2-12)
   goals met: 0 of 1
3. (sup_walk-supporter pos2-4 pos1-4)
   deleted: (supporter_turn) (at-supporter pos2-4)
   added: (prime_turn) (at-supporter pos1-4)
   goals met: 0 of 1
4. (pri_walk-prime pos2-12 pos2-11)
   deleted: (prime_turn) (at-prime pos2-12)
   added: (supporter_turn) (at-prime pos2-11)
   goals met: 0 of 1
5. (sup_get-into-car-supporter pos1-4 car0)
   deleted: (supporter_turn) (at-supporter pos1-4) (free car0)
   added: (prime_turn) (supporter-inside car0)
   goals met: 0 of 1
6. (pri_walk-prime pos2-11 pos1-11)
   deleted: (prime_turn) (at-prime pos2-11)
   added: (supporter_turn) (at-prime pos1-11)
   goals met: 0 of 1
7. (sup_drive-supporter pos1-4 pos0-4 car0)
   deleted: (supporter_turn) (at-car car0 pos1-4)
   added: (prime_turn) (at-car car0 pos0-4)
   goals met: 0 of 1
8. (pri_walk-prime pos1-11 pos0-11)
   deleted: (prime_turn) (at-prime pos1-11)
   added: (supporter_turn) (at-prime pos0-11)
   goals met: 0 of 1
9. (sup_drive-supporter pos0-4 pos0-6 car0)
   deleted: (supporter_turn) (at-car car0 pos0-4)
   added: (prime_turn) (at-car car0 pos0-6)
   goals met: 0 of 1
10. (pri_walk-prime pos0-11 pos0-10)
   deleted: (prime_turn) (at-prime pos0-11)
   added: (supporter_turn) (at-prime pos0-10)
   goals met: 0 of 1
11. (sup_drive-supporter pos0-6 pos0-9 car0)
   deleted: (supporter_turn) (at-car car0 pos0-6)
   added: (prime_turn) (at-car car0 pos0-9)
   goals met: 0 of 1
12. (pri_walk-prime pos0-10 pos0-9)
   deleted: (prime_turn) (at-prime pos0-10)
   added: (supporter_turn) (at-prime pos0-9)
   goals met: 0 of 1
13. (sup_get-out-car-supporter pos0-9 car0)
   deleted: (supporter_turn) (supporter-inside car0)
   added: (prime_turn) (at-supporter pos0-9) (free car0)
   goals met: 0 of 1
14. (pri_get-into-car-prime pos0-9 car0)
   deleted: (prime_turn) (at-prime pos0-9) (free car0)
   added: (supporter_turn) (prime-inside car0)
   goals met: 0 of 1
15. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
16. (pri_drive-prime pos0-9 pos0-6 car0)
   deleted: (prime_turn) (at-car car0 pos0-9)
   added: (supporter_turn) (at-car car0 pos0-6)
   goals met: 0 of 1
17. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
18. (pri_drive-prime pos0-6 pos0-3 car0)
   deleted: (prime_turn) (at-car car0 pos0-6)
   added: (supporter_turn) (at-car car0 pos0-3)
   goals met: 0 of 1
19. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
20. (pri_drive-prime pos0-3 pos1-3 car0)
   deleted: (prime_turn) (at-car car0 pos0-3)
   added: (supporter_turn) (at-car car0 pos1-3)
   goals met: 0 of 1
21. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
22. (pri_get-out-car-prime pos1-3 car0)
   deleted: (prime_turn) (prime-inside car0)
   added: (supporter_turn) (at-prime pos1-3) (free car0)
   goals met: 1 of 1
